
&НаКлиенте
Процедура _ЗаполнитьПоТаблицеВместо(Команда)
	
	ОткрытьФорму("Обработка._ЗагрузкаНоменклатуры.Форма.Форма", Новый Структура("ЭтоЗагрузкаМатериалов", Истина),,,,, Новый ОписаниеОповещения("_ЗаполнениеМатериаловПослеЗакрытия", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура _ЗаполнениеМатериаловПослеЗакрытия(Результат, ДополнительныеПараметры)Экспорт 
	
	Если Не ЗначениеЗаполнено(Результат) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьМатериалыНаСервере(Результат);
	
КонецПроцедуры

Процедура ЗагрузитьМатериалыНаСервере(Результат)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(Результат);
	
	Объект.МатериалыИУслуги.Очистить();
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		НоваяСтрока = Объект.МатериалыИУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.СпособПолученияМатериала = Перечисления.СпособыПолученияМатериаловВСпецификации.Обеспечивать;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", НоваяСтрока.Характеристика);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", НоваяСтрока.Упаковка);
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакСерииИспользуются", Новый Структура("Номенклатура", "СерииИспользуются"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		
		СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "МатериалыИУслуги"));
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
		
	КонецЦикла;

КонецПроцедуры
